Tekla Open API Reference for Tekla Structures 2025
LocalizeForm Class
 The LocalizeForm class is for localizing the forms.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.UIControls.LocalizeForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class LocalizeForm
Public NotInheritable Class LocalizeForm
The LocalizeForm type exposes the following members.
Properties
Name | Description
Localization
 Gets the localization for the dialog.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace